In [1]:
mysql://stu2101213030:stu2101213030@162.105.146.37:43306

In [2]:
show databases;

,Database
0,dataset
1,information_schema
2,stu2101213030

In [3]:
use dataset;

In [4]:
show tables;

,Tables_in_dataset
0,SurnameOrigin
1,TheWorldHappinessReport2015
2,TheWorldHappinessReport2016
3,TheWorldHappinessReport2017
4,TheWorldHappinessReport2018
5,TheWorldHappinessReport2019
6,itemscore
7,stock
8,supermarketTrans
9,titanic_gender_submission
10,titanic_test
11,titanic_train
12,xzqh

In [5]:
select * from supermarketTrans limit 10;

,Customer_ID,No_Transaksi,Tanggal,Items
0,10253,548252,2017-06-14,"Telur, Minyak, Permen, Tepung"
1,10104,548253,2017-12-25,"Deterjen, Kecap, Susu, Sabun"
2,10271,548530,2017-12-10,"Telur, Minyak, Kecap, Snack, Permen, Tepung"
3,10257,548436,2018-05-21,"Deterjen, Kecap, Sabun"
4,10281,548442,2018-01-02,"Telur, Minyak, Kecap, Snack, Permen, Tepung"
5,10181,548400,2018-05-12,"Telur, Deterjen, Minyak, Sabun, Snack, Permen, Tepung"
6,10303,548250,2017-07-02,"Telur, Deterjen, Minyak, Snack, Permen, Tepung"
7,10186,548367,2018-05-11,"Telur, Kecap, Sabun, Snack, Permen"
8,10131,548477,2017-08-15,"Telur, Minyak, Kecap, Susu, Snack, Permen, Tepung"
9,10016,548486,2018-08-12,"Telur, Deterjen, Minyak, Kecap, Susu, Tepung"